[WOTCTrainerText]
Title="修改器"
PhaseNotice="开发测试版：请先保存。已编译的功能仍需实机与存读档验证。"
Tabs[0]="资源"
Tabs[1]="人员"
Tabs[2]="士兵"
Tabs[3]="战略"
Tabs[4]="装备"
Tabs[5]="战术"
Tabs[6]="任务"
Tabs[7]="危险功能"
Resources[0]="补给"
Resources[1]="情报"
Resources[2]="外星合金"
Resources[3]="超铀水晶"
Resources[4]="超铀核心"
Resources[5]="XCOM 共享 AP"
CurrentValue="当前数值"
QuickAdd="快捷增加（确认后生效）"
SetValue="自定义数值"
Confirm="确认修改"
Cancel="取消"
Close="关闭"
Arrow=" → "
Engineers="工程师"
Scientists="科学家"
AddEngineer="+1 工程师"
AddScientist="+1 科学家"
PersonnelHelp="通过游戏自身流程生成全新且唯一的人员，自动设置合法身份、外观和技能等级，并加入复仇者号人员名单。"
HealAll="治疗所有士兵"
HealingCount="可完成的士兵治疗项目"
HealingHelp="完成兵营中存活、未被俘士兵的正常治疗项目，恢复生命并解除伤势。按原版规则，可能将意志恢复至就绪下限，并恢复暂停的灵能训练。死亡、被俘或没有合法治疗项目的单位不会被处理。"
NothingToHeal="当前没有符合条件的士兵治疗项目。"
PendingPhase="当前版本尚未实现。"
Applied="已提交："
Added="新增："
CompletedCount="停止前已完成："
InvalidNumber="请输入 0 至 2147483647 的整数；不接受负数、小数或超出范围的值。"
Unavailable="此操作仅在已载入的单机战略战役中可用。"
Stale="游戏状态已变化，本次未继续提交。请刷新后重新确认。"
SubmitFailed="游戏未接受本次状态提交。"
VerifyFailed="提交后的数据与预期不符。请检查游戏和 Launch.log，再决定是否重试。"
MissingResource="HQ 库存缺少此资源条目，本次未提交修改。"
SaveReminder="该操作可能改变战役状态，建议提前保存。"
InputTitle="设置新总数（0 至 2147483647）"
SoldierEditor="兵营士兵编辑器"
Refresh="刷新"
Barracks="兵营人数"
RestoreDefault="模板默认值"
FullHeal="完全治疗 / 清除伤势"
RestoreWill="恢复意志 / 解除疲劳"
RemoveTraits="移除负面特质"
RankAndClass="军衔 / 新兵职业…"
SoldierFields[0]="生命"
SoldierFields[1]="命中"
SoldierFields[2]="移动"
SoldierFields[3]="意志"
SoldierFields[4]="侵入"
SoldierFields[5]="闪避"
SoldierFields[6]="防御"
SoldierFields[7]="个人 AP"
SoldierFields[8]="经验 XP"
SoldierHelp="显示基础属性：生命/移动/意志为 1–1000，其余属性为 0–1000；AP 为 0–100000。模板默认值不包含军衔加成。修改生命/意志上限前先治疗/恢复意志。XP 遵循原版上限；WOTC 通常按击杀晋升。"
TemplateDefault="（角色模板，不含晋升加成）"
SpawnHelp="点击职业/军衔循环选择，点击数量输入 1–20。新兵尚未分配职业；指定职业最低列兵。派系士兵要求已接触对应派系。高军衔通过原版逻辑逐级晋升，高阶技能请到原版军械库选择。"
SpawnSoldier="生成士兵…"
Promote="逐级晋升…"
Demote="降级（禁用）"
UnsafeDemote="降级与已晋升士兵转职已禁用：SDK 调试重置流程未完整处理 WOTC 已花费 AP 与持久能力。新兵可在晋升时选择四种普通职业。"
Revive="复活阵亡士兵（禁用）"
Unsafe="该功能当前版本不安全，已禁用。"
ClassLabel="职业"
RankLabel="军衔"
CountLabel="数量"
RookieClass="新兵晋升职业："
SelectSoldierFirst="请先在士兵编辑器选择士兵，再点击“军衔 / 新兵职业”。"
CountInput="生成数量（1–20）"
Bounds="数值超出该控件允许范围，请检查说明。"
Unsupported="当前游戏模板不支持安全执行此操作。"
FactionLocked="请先在战役中接触对应抵抗派系，再添加该派系士兵。"
UnitUnavailable="只读：仅可修改兵营中存活、未被俘、处于待命或治疗中且未执行秘密行动的士兵。"
HealFirst="请先完成该士兵的正常治疗项目，再修改生命上限。"
WillFirst="请先恢复意志，再修改意志上限，以保持恢复项目同步。"
XPCap="XP 超出原版当前晋升上限，或此军衔的 AddXp 路径不能安全使用。请使用逐级晋升。"
NoWillProject="该士兵没有合法的意志恢复项目，本次未提交修改。"
TacticalHelp="仅限当前任务的 XCOM 士兵。命中/暴击针对标准命中判定攻击。回血不清除异常状态或战后伤势。重置冷却显示冷却中技能数量。无限弹药与无需装填均自动补满弹匣。"
TacticalUnavailable="仅在单机战术的 XCOM 行动阶段可用；请选中存活的 XCOM 士兵并等待当前动作结束。"
Teleport="传送（禁用）"
SelectedUnit="当前选择："
ActionPoints="行动点"
OnLabel="开启"
OffLabel="关闭"
TacticalToggles[0]="全队无敌"
TacticalToggles[1]="选中士兵无敌"
TacticalToggles[2]="无限行动"
TacticalToggles[3]="无限移动"
TacticalToggles[4]="射击不结束回合"
TacticalToggles[5]="无限弹药"
TacticalToggles[6]="无需装填"
TacticalToggles[7]="无技能冷却"
TacticalToggles[8]="无限技能 / 物品充能"
TacticalToggles[9]="100% 命中"
TacticalToggles[10]="100% 暴击"
TacticalToggles[11]="一击必杀"
TacticalActions[0]="恢复全部生命"
TacticalActions[1]="+1 行动点"
TacticalActions[2]="+1 移动行动点"
TacticalActions[3]="装填主武器"
TacticalActions[4]="重置技能冷却"
MissionControl="任务控制 / 修复诊断"
ObjectiveHelp="左侧为实际任务记录（内部 ID），右侧为中文 HUD 目标。SDK 没有提供两者可靠的逐项映射。完成记录不会自动绕过各任务的脚本条件。"
MissionState="规则状态"
Enemies="异形单位"
Reinforcements="待生成增援"
InvalidTiles="越界 Tile"
PendingSubmission="正在进行潜在状态提交"
NoEnemiesHint="未发现存活异形或失魂者。可检查未完成的 Sweep 目标与待增援；仅此不能判定任务故障。"
RefreshObjectives="刷新任务目标显示"
CompleteSelected="完成选中目标记录…"
SkipAI="跳过当前 AI 回合…"
RestartMission="重开当前任务…"
MissionLimits="跳过 AI 无法中断正在提交的状态。同种子重开与强制全队撤离在找到可审计 API 前仍然禁用。"
InternalObjectives="任务记录（内部 ID）"
HUDObjectives="中文 HUD 目标状态"
IncompleteLabel="未完成"
CompletedLabel="已完成"
SkipAIHelp="当前敌方玩家：行动中 → 请求跳过回合。使用原版 SkipTurn 状态流程，可用于部分 AI 卡顿；无法处理动画或潜在状态提交卡死。"
RestartHelp="当前任务进度 → 原版重开任务。未保存的战术进度会丢失。铁人和教程中禁用；不保证随机种子相同。"
EndMissionHelp="完成全部记录可能影响战役奖励。胜利结束使用原版 EndBattle，且必须先满足任务自身成功条件；不会伪造营救或战役成功。失败结束也使用正常结束状态。"
CompleteAll="完成全部未完成目标记录…"
EndVictory="按胜利结束任务…"
EndFailure="按失败结束任务…"
SameSeed="同种子重开（禁用）"
EvacSquad="强制全队撤离（禁用）"
ActiveMission="任务进行中"
AIBusy="当前没有可跳过的 AI 行动阶段。请等待状态提交完成。"
CompleteFirst="尚未满足任务的原版成功条件。请先检查实际任务目标、VIP/营救及其他场景要求。"
NoObjectives="未选中可完成的任务目标记录。"
RepairAI="禁用 AI 行动规划…"
RestoreAI="恢复 AI 行动规划…"
AIHangHelp="设置 AI 玩家的跳过标志，与原版 SkipAI 控制台命令及 SeqAct_SkipAI 关卡节点使用同一开关。停滞的 AI 玩家会通过引擎自身的结束回合流程结束回合，而不是被强制重置。"
AIHangNote="仅为临时状态：不会保存，不属于 GameState。不会修改任务目标与单位。重新载入任务后复位。"
AIHangScope="AI 回合控制"
RoleTactical="战术"
RoleStrategy="战略"
RoleTriad="三方"
RoleNone="本任务未配置战术或战略目标。"
ObjectiveLoot="战利品"
ObjectiveList="任务目标"
VictoryReady="任务成功条件已满足；战役将记录为成功。"
VictoryBlockedBy="战役成功条件尚未满足："
TurnOwner="当前行动方"
SweepNote="原版规则：只有当所有战术目标完成后，任务结算才会回收阵亡士兵遗体并清扫战利品。先补齐缺失的目标即可恢复该结算。"
LootSweepBlocked="清扫未结算：阵亡遗体与战利品不会被回收。"
SameSeedWhy="已禁用：原版 RestartLevelWithSameSeed 还会调用 XComCheatManager.SetSeedOverride，该函数为 native 实现、无源码可核对。缺少这一步无法证明复用了同一随机种子，因此不提供该功能。"
TeamXCom="XCOM"
TeamAlien="外星人"
TeamLost="失落者"
TeamResistance="抵抗组织"
TeamNeutral="中立"
TeamOne="阵营一"
TeamTwo="阵营二"
TeamOther="其他"
